doc/s-sql-a.org
#+TITLE: S-SQL Examples A
#+OPTIONS: num:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
#+HTML_HEAD: <style>pre.src{background:#343131;color:white;} </style>
#+OPTIONS: ^:nil

* [[file:s-sql-examples.org][S-SQL Examples Home Page]]
| [[file:s-sql-a.org][A]]| [[file:s-sql-b.org][B]]| [[file:s-sql-c.org][C]]| [[file:s-sql-d.org][D]]| [[file:s-sql-e.org][E]]| [[file:s-sql-f.org][F]]| [[file:s-sql-g.org][G]]| [[file:s-sql-h.org][H]]| [[file:s-sql-i.org][I]]| [[file:s-sql-j.org][J]]| [[file:s-sql-k.org][K]]| [[file:s-sql-l.org][L]]| [[file:s-sql-m.org][M]]| [[file:s-sql-n.org][N]]| [[file:s-sql-o.org][O]]| [[file:s-sql-p.org][P]]| [[file:s-sql-r.org][R]]| [[file:s-sql-s.org][S]]| [[file:s-sql-t.org][T]]| [[file:s-sql-u.org][U]]| [[file:s-sql-v.org][V]]| [[file:s-sql-w.org][W]]|  [[file:s-sql-special-characters.org][Special Characters]]                        |  [[file:calling-postgresql-stored-functions.org][Calling Postgresql Stored Functions and Procedures]]|

* Alter Table
:PROPERTIES:
:CUSTOM_ID: alter-table
:END:
#+begin_src lisp
(query (:alter-table "countries" :add-column "stuff4" :type integer :default 0))

(query (:alter-table "countries" :add-column "stuff4" :type integer))

(query (:alter-table "countries" :add-column "stuff4" :type (or db-null integer)))

#+end_src

The difference between these versions is how they handle nulls. The first will generate a column that cannot be null and will set a default of 0. The second will not set a default but will still generate a column that cannot be null. The third will not set a default and the column is allowed to be null. Note that because the table name is in double quotes, if you have a multiple word table name, the words must be separated by the normal sql underscores, not the normal "lispy" hyphens.

You can use sql-compile to build the alter-table statements dynamically like so:
#+begin_src lisp
  (let ((table "countries") (column "stuff4"))
    (query (sql-compile `(:alter-table ,table :add-column ,column
                          :type (or db-null integer)))))

#+end_src

** Altering Columns
:PROPERTIES:
:CUSTOM_ID: alter-column
:END:
At the moment, altering columns requires that you still include a blank :type keyword.

As an example, assume you created a table named "test2" with a column named "description" with a not null constraint

and you want to drop the not null constraint on the table. Either of the following will work

(the only differences being whether you  quote the names or use strings for the names):
#+begin_src lisp
(query (:alter-table "test2" :alter-column "description" :type (:drop not-null)))

(query (:alter-table 'test2 :alter-column 'description :type (:drop not-null)))

#+end_src

* And
  :PROPERTIES:
  :CUSTOM_ID: and
  :END:
#+begin_src lisp
      (query (:select 'countries.name
                    :from 'countries 'regions
                    :where (:and (:= 'regions.name "North America")
                                 (:= 'regions.id 'countries.region-id))))

    (("Bermuda") ("Canada") ("Greenland") ("Mexico") ("US"))

    (query (:select 'countries.name
                    :from 'countries 'regions
                    :where (:and (:= 'region-id 'regions.id)
                                 (:= 'regions.name "Central America")
                                 (:< 'latitude 12))))

  (("Costa Rica") ("Panama"))
#+end_src

