doc/s-sql-a.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-01-04 Thu 08:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>S-SQL Examples A</title>
<meta name="author" content="Sabra Crolleton" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">S-SQL Examples A</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc723a3e">S-SQL Examples Home Page</a></li>
<li><a href="#alter-table">Alter Table</a>
<ul>
<li><a href="#alter-column">Altering Columns</a></li>
</ul>
</li>
<li><a href="#and">And</a></li>
<li><a href="#analyze">Analyze</a></li>
<li><a href="#any">Any, Any*</a></li>
<li><a href="#arrays">Arrays - see Array-Notes</a></li>
<li><a href="#as">As (sometimes referred to as Alias)</a></li>
<li><a href="#avg">Avg</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgc723a3e" class="outline-2">
<h2 id="orgc723a3e"><a href="s-sql-examples.html">S-SQL Examples Home Page</a></h2>
<div class="outline-text-2" id="text-orgc723a3e">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="s-sql-a.html">A</a></td>
<td class="org-left"><a href="s-sql-b.html">B</a></td>
<td class="org-left"><a href="s-sql-c.html">C</a></td>
<td class="org-left"><a href="s-sql-d.html">D</a></td>
<td class="org-left"><a href="s-sql-e.html">E</a></td>
<td class="org-left"><a href="s-sql-f.html">F</a></td>
<td class="org-left"><a href="s-sql-g.html">G</a></td>
<td class="org-left"><a href="s-sql-h.html">H</a></td>
<td class="org-left"><a href="s-sql-i.html">I</a></td>
<td class="org-left"><a href="s-sql-j.html">J</a></td>
<td class="org-left"><a href="s-sql-k.html">K</a></td>
<td class="org-left"><a href="s-sql-l.html">L</a></td>
<td class="org-left"><a href="s-sql-m.html">M</a></td>
<td class="org-left"><a href="s-sql-n.html">N</a></td>
<td class="org-left"><a href="s-sql-o.html">O</a></td>
<td class="org-left"><a href="s-sql-p.html">P</a></td>
<td class="org-left"><a href="s-sql-r.html">R</a></td>
<td class="org-left"><a href="s-sql-s.html">S</a></td>
<td class="org-left"><a href="s-sql-t.html">T</a></td>
<td class="org-left"><a href="s-sql-u.html">U</a></td>
<td class="org-left"><a href="s-sql-v.html">V</a></td>
<td class="org-left"><a href="s-sql-w.html">W</a></td>
<td class="org-left"><a href="s-sql-special-characters.html">Special Characters</a></td>
<td class="org-left"><a href="calling-postgresql-stored-functions.html">Calling Postgresql Stored Functions and Procedures</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-alter-table" class="outline-2">
<h2 id="alter-table">Alter Table</h2>
<div class="outline-text-2" id="text-alter-table">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:alter-table</span> <span class="org-string">"countries"</span> <span class="org-builtin">:add-column</span> <span class="org-string">"stuff4"</span> <span class="org-builtin">:type</span> integer <span class="org-builtin">:default</span> 0))

(query (<span class="org-builtin">:alter-table</span> <span class="org-string">"countries"</span> <span class="org-builtin">:add-column</span> <span class="org-string">"stuff4"</span> <span class="org-builtin">:type</span> integer))

(query (<span class="org-builtin">:alter-table</span> <span class="org-string">"countries"</span> <span class="org-builtin">:add-column</span> <span class="org-string">"stuff4"</span> <span class="org-builtin">:type</span> (or db-null integer)))

</pre>
</div>

<p>
The difference between these versions is how they handle nulls. The first will generate a column that cannot be null and will set a default of 0. The second will not set a default but will still generate a column that cannot be null. The third will not set a default and the column is allowed to be null. Note that because the table name is in double quotes, if you have a multiple word table name, the words must be separated by the normal sql underscores, not the normal "lispy" hyphens.
</p>

<p>
You can use sql-compile to build the alter-table statements dynamically like so:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">let</span> ((table <span class="org-string">"countries"</span>) (column <span class="org-string">"stuff4"</span>))
  (query (sql-compile `(<span class="org-builtin">:alter-table</span> ,table <span class="org-builtin">:add-column</span> ,column
                        <span class="org-builtin">:type</span> (or db-null integer)))))

</pre>
</div>
</div>

<div id="outline-container-alter-column" class="outline-3">
<h3 id="alter-column">Altering Columns</h3>
<div class="outline-text-3" id="text-alter-column">
<p>
At the moment, altering columns requires that you still include a blank :type keyword.
</p>

<p>
As an example, assume you created a table named "test2" with a column named "description" with a not null constraint
</p>

<p>
and you want to drop the not null constraint on the table. Either of the following will work
</p>

<p>
(the only differences being whether you  quote the names or use strings for the names):
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:alter-table</span> <span class="org-string">"test2"</span> <span class="org-builtin">:alter-column</span> <span class="org-string">"description"</span> <span class="org-builtin">:type</span> (<span class="org-builtin">:drop</span> not-null)))

(query (<span class="org-builtin">:alter-table</span> 'test2 <span class="org-builtin">:alter-column</span> 'description <span class="org-builtin">:type</span> (<span class="org-builtin">:drop</span> not-null)))

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-and" class="outline-2">
<h2 id="and">And</h2>
<div class="outline-text-2" id="text-and">
<div class="org-src-container">
<pre class="src src-lisp">    (query (<span class="org-builtin">:select</span> 'countries.name
                  <span class="org-builtin">:from</span> 'countries 'regions
                  <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:=</span> 'regions.name <span class="org-string">"North America"</span>)
                               (<span class="org-builtin">:=</span> 'regions.id 'countries.region-id))))

  ((<span class="org-string">"Bermuda"</span>) (<span class="org-string">"Canada"</span>) (<span class="org-string">"Greenland"</span>) (<span class="org-string">"Mexico"</span>) (<span class="org-string">"US"</span>))

  (query (<span class="org-builtin">:select</span> 'countries.name
                  <span class="org-builtin">:from</span> 'countries 'regions
                  <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:=</span> 'region-id 'regions.id)
                               (<span class="org-builtin">:=</span> 'regions.name <span class="org-string">"Central America"</span>)
                               (<span class="org-builtin">:&lt;</span> 'latitude 12))))

((<span class="org-string">"Costa Rica"</span>) (<span class="org-string">"Panama"</span>))
</pre>
</div>
</div>
</div>
