doc/s-sql-a.org
* Analyze
  :PROPERTIES:
  :CUSTOM_ID: analyze
  :END:
  The [[https://www.postgresql.org/docs/current/sql-analyze.html][official Postgresql documents]] note that analyze collects statistics about a database and provides various options, whether you want specific tables and columns or the entire database, etc. The following is a series of examples of how it can be used in s-sql with increasing levels of complexity. Options can be set to true with t, 1 or :on and set to false with :nil 0 or off.
#+begin_src lisp
  (query (:analyze))

  (query (:analyze :verbose))
  ;; Now specifying just analyzing table t1
  (query (:analyze :verbose :tables 't1))

  (query (:analyze :verbose :tables :t1))
  ;; Now specifying just analyzing tables t1 and t2
  (query (:analyze :verbose :tables :t1 :t2))

  (query (:analyze :verbose :tables 't1 't2))
  ;; Now specifying columns in tables t1 and t2
  (query (:analyze :verbose
          :tables (:t1 't1c1 't1c2) (:t2 't2c1 't2c2 't2c3)))
  ;; Alternative syntax for the columns
  (query (:analyze :verbose :tables (:t1 :t1c1 :t1c2)))
  ;; Starting to look at more specific options
  (query (:analyze :option (:verbose t)
                   :tables (:t1 't1c1 't1c2) (:t2 't2c1 't2c)))
  ;; The following will set option verbose to true, skip-locked to false
  ;; and buffer-usage-limit to 70MB
  (query (:analyze :option (:verbose 1) (:skip-locked 0) (:buffer-usage-limit "70MB")
                   :tables (:t1 't1c1 't1c2) (:t2 't2c1 't2c)))
  ;; The following will set option verbose to true, skip-locked to false
  ;; and buffer-usage-limit to 70MB
  (query (:analyze :option (:verbose t) (:skip-locked nil) (:buffer-usage-limit "70MB")
                   :tables (:t1 't1c1 't1c2) (:t2 't2c1 't2c)))

#+end_src
* Any, Any*
  :PROPERTIES:
  :CUSTOM_ID: any
  :END:
Any needs to be considered as a special case. Quoting Marijn Haverbeke here,"Postgres has both a function-call-style any and an infix any, and S-SQL's syntax doesn't allow them to be distinguished." As a result, postmodern has a regular :any sql-op and a :any* sql-op, which expand slightly differently.

In general, the any qualifier in an sql statement looks at a subquery and does a comparison against that subquery. Sticking with our countries table, we have latitude, longitude data for every country (I'm not sure whether my table pulled the capital cities or the geographic center) and some designated a region for each country, so we have a region-id that matches the primary key 'id' in a regions table.

Out of curiosity, let's determine which countries in "North America" have a longitude less than any country in "South America". The standard sql could look like this:
#+begin_src lisp
  (query "select countries.name
               from countries,regions
               where regions.id=region_id
               and regions.name='North America'
               and longitude > any(select longitude
                                          from countries, regions
                                          where region_id = regions.id
                                          and regions.name='South America')")

(("Bermuda") ("Greenland"))
#+end_src

This can be re-phrased in s-sql as
#+begin_src lisp
  (query  (:select 'countries.name
           :from 'countries 'regions
                   :where (:and (:= 'regions.id 'region-id)
                                (:= 'regions.name "North America")
                                (:> 'longitude
                                    (:any
                                     (:select 'longitude
                                      :from 'countries 'regions
                                              :where (:and (:= 'regions.id 'region-id)
                                                           (:= 'regions.name
                                                               "South America"))))))))

  (("Bermuda") ("Greenland"))
#+end_src

Subselects work fine in both regular sql and s-sql. If you have already calculated your subselect and put it in a variable, that variable can be a list or a vector and whether you should use the :any sql-op or the :any* sql-op depends on your phrasing. (Notice that the second variation has an asterisk).

The SQL keyword ANY can be used in a parameterized sql statement. The following two toy examples work in raw sql.
#+begin_src lisp
  (query "select name from countries where id=any($1)"
         (vector 21 22))

  (("Iceland") ("US"))

  (let ((toy-query (vector 21 22)))
    (query "select name from countries where id=any($1)"
           toy-query))

  (("Iceland") ("US"))
#+end_src
Now using s-sql and keeping with the toy example, notice that using :any does not work, but using :any* does work.
#+begin_src lisp
  (let ((toy-query '(21 22)))
    (query (:select 'name
            :from 'countries
            :where (:= 'id (:any '$1)))
           toy-query))

  ;; Evaluation aborted on
  ;; #<CL-POSTGRES-ERROR:SYNTAX-ERROR-OR-ACCESS-VIOLATION {10030AF6A1}>.

  (let ((toy-query '(21 22)))
    (query (:select 'name
            :from 'countries
            :where (:= 'id (:any* '$1)))
           toy-query))

  (("Iceland") ("US"))
#+end_src

* Arrays - see [[file:array-notes.html][Array-Notes]]
  :PROPERTIES:
  :CUSTOM_ID: arrays
  :END:
