doc/s-sql-a.html

<div id="outline-container-analyze" class="outline-2">
<h2 id="analyze">Analyze</h2>
<div class="outline-text-2" id="text-analyze">
<p>
The <a href="https://www.postgresql.org/docs/current/sql-analyze.html">official Postgresql documents</a> note that analyze collects statistics about a database and provides various options, whether you want specific tables and columns or the entire database, etc. The following is a series of examples of how it can be used in s-sql with increasing levels of complexity. Options can be set to true with t, 1 or :on and set to false with :nil 0 or off.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:analyze</span>))

(query (<span class="org-builtin">:analyze</span> <span class="org-builtin">:verbose</span>))
<span class="org-comment-delimiter">;; </span><span class="org-comment">Now specifying just analyzing table t1</span>
(query (<span class="org-builtin">:analyze</span> <span class="org-builtin">:verbose</span> <span class="org-builtin">:tables</span> 't1))

(query (<span class="org-builtin">:analyze</span> <span class="org-builtin">:verbose</span> <span class="org-builtin">:tables</span> <span class="org-builtin">:t1</span>))
<span class="org-comment-delimiter">;; </span><span class="org-comment">Now specifying just analyzing tables t1 and t2</span>
(query (<span class="org-builtin">:analyze</span> <span class="org-builtin">:verbose</span> <span class="org-builtin">:tables</span> <span class="org-builtin">:t1</span> <span class="org-builtin">:t2</span>))

(query (<span class="org-builtin">:analyze</span> <span class="org-builtin">:verbose</span> <span class="org-builtin">:tables</span> 't1 't2))
<span class="org-comment-delimiter">;; </span><span class="org-comment">Now specifying columns in tables t1 and t2</span>
(query (<span class="org-builtin">:analyze</span> <span class="org-builtin">:verbose</span>
        <span class="org-builtin">:tables</span> (<span class="org-builtin">:t1</span> 't1c1 't1c2) (<span class="org-builtin">:t2</span> 't2c1 't2c2 't2c3)))
<span class="org-comment-delimiter">;; </span><span class="org-comment">Alternative syntax for the columns</span>
(query (<span class="org-builtin">:analyze</span> <span class="org-builtin">:verbose</span> <span class="org-builtin">:tables</span> (<span class="org-builtin">:t1</span> <span class="org-builtin">:t1c1</span> <span class="org-builtin">:t1c2</span>)))
<span class="org-comment-delimiter">;; </span><span class="org-comment">Starting to look at more specific options</span>
(query (<span class="org-builtin">:analyze</span> <span class="org-builtin">:option</span> (<span class="org-builtin">:verbose</span> t)
                 <span class="org-builtin">:tables</span> (<span class="org-builtin">:t1</span> 't1c1 't1c2) (<span class="org-builtin">:t2</span> 't2c1 't2c)))
<span class="org-comment-delimiter">;; </span><span class="org-comment">The following will set option verbose to true, skip-locked to false</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">and buffer-usage-limit to 70MB</span>
(query (<span class="org-builtin">:analyze</span> <span class="org-builtin">:option</span> (<span class="org-builtin">:verbose</span> 1) (<span class="org-builtin">:skip-locked</span> 0) (<span class="org-builtin">:buffer-usage-limit</span> <span class="org-string">"70MB"</span>)
                 <span class="org-builtin">:tables</span> (<span class="org-builtin">:t1</span> 't1c1 't1c2) (<span class="org-builtin">:t2</span> 't2c1 't2c)))
<span class="org-comment-delimiter">;; </span><span class="org-comment">The following will set option verbose to true, skip-locked to false</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">and buffer-usage-limit to 70MB</span>
(query (<span class="org-builtin">:analyze</span> <span class="org-builtin">:option</span> (<span class="org-builtin">:verbose</span> t) (<span class="org-builtin">:skip-locked</span> nil) (<span class="org-builtin">:buffer-usage-limit</span> <span class="org-string">"70MB"</span>)
                 <span class="org-builtin">:tables</span> (<span class="org-builtin">:t1</span> 't1c1 't1c2) (<span class="org-builtin">:t2</span> 't2c1 't2c)))

</pre>
</div>
</div>
</div>
<div id="outline-container-any" class="outline-2">
<h2 id="any">Any, Any*</h2>
<div class="outline-text-2" id="text-any">
<p>
Any needs to be considered as a special case. Quoting Marijn Haverbeke here,"Postgres has both a function-call-style any and an infix any, and S-SQL's syntax doesn't allow them to be distinguished." As a result, postmodern has a regular :any sql-op and a :any* sql-op, which expand slightly differently.
</p>

<p>
In general, the any qualifier in an sql statement looks at a subquery and does a comparison against that subquery. Sticking with our countries table, we have latitude, longitude data for every country (I'm not sure whether my table pulled the capital cities or the geographic center) and some designated a region for each country, so we have a region-id that matches the primary key 'id' in a regions table.
</p>

<p>
Out of curiosity, let's determine which countries in "North America" have a longitude less than any country in "South America". The standard sql could look like this:
</p>
<div class="org-src-container">
<pre class="src src-lisp">  (query <span class="org-string">"select countries.name</span>
<span class="org-string">               from countries,regions</span>
<span class="org-string">               where regions.id=region_id</span>
<span class="org-string">               and regions.name='North America'</span>
<span class="org-string">               and longitude &gt; any(select longitude</span>
<span class="org-string">                                          from countries, regions</span>
<span class="org-string">                                          where region_id = regions.id</span>
<span class="org-string">                                          and regions.name='South America')"</span>)

((<span class="org-string">"Bermuda"</span>) (<span class="org-string">"Greenland"</span>))
</pre>
</div>

<p>
This can be re-phrased in s-sql as
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query  (<span class="org-builtin">:select</span> 'countries.name
         <span class="org-builtin">:from</span> 'countries 'regions
                 <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:=</span> 'regions.id 'region-id)
                              (<span class="org-builtin">:=</span> 'regions.name <span class="org-string">"North America"</span>)
                              (<span class="org-builtin">:&gt;</span> 'longitude
                                  (<span class="org-builtin">:any</span>
                                   (<span class="org-builtin">:select</span> 'longitude
                                    <span class="org-builtin">:from</span> 'countries 'regions
                                            <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:=</span> 'regions.id 'region-id)
                                                         (<span class="org-builtin">:=</span> 'regions.name
                                                             <span class="org-string">"South America"</span>))))))))

((<span class="org-string">"Bermuda"</span>) (<span class="org-string">"Greenland"</span>))
</pre>
</div>

<p>
Subselects work fine in both regular sql and s-sql. If you have already calculated your subselect and put it in a variable, that variable can be a list or a vector and whether you should use the :any sql-op or the :any* sql-op depends on your phrasing. (Notice that the second variation has an asterisk).
</p>

<p>
The SQL keyword ANY can be used in a parameterized sql statement. The following two toy examples work in raw sql.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span class="org-string">"select name from countries where id=any($1)"</span>
       (vector 21 22))

((<span class="org-string">"Iceland"</span>) (<span class="org-string">"US"</span>))

(<span class="org-keyword">let</span> ((toy-query (vector 21 22)))
  (query <span class="org-string">"select name from countries where id=any($1)"</span>
         toy-query))

((<span class="org-string">"Iceland"</span>) (<span class="org-string">"US"</span>))
</pre>
</div>
<p>
Now using s-sql and keeping with the toy example, notice that using :any does not work, but using :any* does work.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">let</span> ((toy-query '(21 22)))
  (query (<span class="org-builtin">:select</span> 'name
          <span class="org-builtin">:from</span> 'countries
          <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'id (<span class="org-builtin">:any</span> '$1)))
         toy-query))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Evaluation aborted on</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">#&lt;CL-POSTGRES-ERROR:SYNTAX-ERROR-OR-ACCESS-VIOLATION {10030AF6A1}&gt;.</span>

(<span class="org-keyword">let</span> ((toy-query '(21 22)))
  (query (<span class="org-builtin">:select</span> 'name
          <span class="org-builtin">:from</span> 'countries
          <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'id (<span class="org-builtin">:any*</span> '$1)))
         toy-query))

((<span class="org-string">"Iceland"</span>) (<span class="org-string">"US"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-arrays" class="outline-2">
<h2 id="arrays">Arrays - see <a href="array-notes.html">Array-Notes</a></h2>
<div class="outline-text-2" id="text-arrays">
</div>
</div>
