doc/s-sql-a.org
* As (sometimes referred to as Alias)
  :PROPERTIES:
  :CUSTOM_ID: as
  :END:
#+begin_src lisp
  (query (:select (:as 'countries.name 'country)
                (:as 'regions.name 'region)
                :from 'countries 'regions
                :where (:and (:= 'regions.id 'region-id)
                             (:= 'regions.name "Central America")))
       :alists)

(((:COUNTRY . "Belize") (:REGION . "Central America"))
 ((:COUNTRY . "Costa Rica")  (:REGION . "Central America"))
 ((:COUNTRY . "El Salvador")  (:REGION . "Central America"))
 ((:COUNTRY . "Guatemala")  (:REGION . "Central America"))
 ((:COUNTRY . "Panama") (:REGION . "Central America"))
 ((:COUNTRY . "Nicaragua") (:REGION . "Central America")))
#+end_src

The following uses aliases for both columns and tables in the from and inner-join clauses:
#+begin_src lisp
  (query (:order-by
        (:select (:as 'recs.firstname 'firstname)
                 (:as 'recs.surname 'surname)
                 :distinct
                 :from (:as 'cd.members 'mems)
                 :inner-join (:as 'cd.members 'recs)
                 :on (:= 'recs.memid 'mems.recommendedby))
        'surname 'firstname))
#+end_src

Note: Postmodern does not allow you to create an unescaped string alias. In other words, you cannot generate this:
#+begin_src lisp
"select sum(slots as "Total Slots" from cd.bookings"
#+end_src
without using :raw

* Avg
  :PROPERTIES:
  :CUSTOM_ID: avg
  :END:
Simple example easily applicable to max and min:
#+begin_src lisp
  (query (:select (:avg 'longitude)
          :from 'countries 'regions
                  :where (:and (:= 'regions.id 'region-id)
                               (:= 'regions.name "North America"))))

  ((-17939/200))
  #+end_src
