doc/s-sql-a.html
<div id="outline-container-as" class="outline-2">
<h2 id="as">As (sometimes referred to as Alias)</h2>
<div class="outline-text-2" id="text-as">
<div class="org-src-container">
<pre class="src src-lisp">  (query (<span class="org-builtin">:select</span> (<span class="org-builtin">:as</span> 'countries.name 'country)
                (<span class="org-builtin">:as</span> 'regions.name 'region)
                <span class="org-builtin">:from</span> 'countries 'regions
                <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:=</span> 'regions.id 'region-id)
                             (<span class="org-builtin">:=</span> 'regions.name <span class="org-string">"Central America"</span>)))
       <span class="org-builtin">:alists</span>)

(((<span class="org-builtin">:COUNTRY</span> . <span class="org-string">"Belize"</span>) (<span class="org-builtin">:REGION</span> . <span class="org-string">"Central America"</span>))
 ((<span class="org-builtin">:COUNTRY</span> . <span class="org-string">"Costa Rica"</span>)  (<span class="org-builtin">:REGION</span> . <span class="org-string">"Central America"</span>))
 ((<span class="org-builtin">:COUNTRY</span> . <span class="org-string">"El Salvador"</span>)  (<span class="org-builtin">:REGION</span> . <span class="org-string">"Central America"</span>))
 ((<span class="org-builtin">:COUNTRY</span> . <span class="org-string">"Guatemala"</span>)  (<span class="org-builtin">:REGION</span> . <span class="org-string">"Central America"</span>))
 ((<span class="org-builtin">:COUNTRY</span> . <span class="org-string">"Panama"</span>) (<span class="org-builtin">:REGION</span> . <span class="org-string">"Central America"</span>))
 ((<span class="org-builtin">:COUNTRY</span> . <span class="org-string">"Nicaragua"</span>) (<span class="org-builtin">:REGION</span> . <span class="org-string">"Central America"</span>)))
</pre>
</div>

<p>
The following uses aliases for both columns and tables in the from and inner-join clauses:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:order-by</span>
      (<span class="org-builtin">:select</span> (<span class="org-builtin">:as</span> 'recs.firstname 'firstname)
               (<span class="org-builtin">:as</span> 'recs.surname 'surname)
               <span class="org-builtin">:distinct</span>
               <span class="org-builtin">:from</span> (<span class="org-builtin">:as</span> 'cd.members 'mems)
               <span class="org-builtin">:inner-join</span> (<span class="org-builtin">:as</span> 'cd.members 'recs)
               <span class="org-builtin">:on</span> (<span class="org-builtin">:=</span> 'recs.memid 'mems.recommendedby))
      'surname 'firstname))
</pre>
</div>

<p>
Note: Postmodern does not allow you to create an unescaped string alias. In other words, you cannot generate this:
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span class="org-string">"select sum(slots as "</span>Total Slots<span class="org-string">" from cd.bookings"</span>
</pre>
</div>
<p>
without using :raw
</p>
</div>
</div>

<div id="outline-container-avg" class="outline-2">
<h2 id="avg">Avg</h2>
<div class="outline-text-2" id="text-avg">
<p>
Simple example easily applicable to max and min:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> (<span class="org-builtin">:avg</span> 'longitude)
        <span class="org-builtin">:from</span> 'countries 'regions
                <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:=</span> 'regions.id 'region-id)
                             (<span class="org-builtin">:=</span> 'regions.name <span class="org-string">"North America"</span>))))

((-17939/200))
</pre>
</div>
</div>
</div>
</div>
</body>
</html>